Repository: mlverse/tabnet
Catalog: po/*.po
Languages: fr

source: `tabnet_explain()` is not defined for a '%s'.
fr: `tabnet_explain()` n’est pas défini pour un ‘%s’.

source: `tabnet_fit()` is not defined for a '%s'.
fr: `tabnet_fit()` n’est pas défini pour un ‘%s’.

source: `tabnet_pretrain()` is not defined for a '%s'.
fr: `tabnet_pretrain()` n’est pas défini pour un ‘%s’.

source: '%s' is not recognised as a proper TabNet model
fr: ‘%s’ n’est pas reconnu comme un modèle TabNet correct

source: The model was trained for less than '%s' epochs
fr: Le modèle a été entrainé sur moins de ‘%s’ époques

source: Error: found missing values in the `%s` outcome column.
fr: Erreur : Il y a des valeurs manquantes dans la colonne de résultats `%s`.

source: Model dimensions don't match.
fr: Les dimensions ne correspondent pas entre les modèles.

source: No model serialized weight can be found in `%s`, check the model history
fr: Il n’y a pas de points sérialisés de modèle dans `%s`, veuillez vérifier l’historique du modèle

source: The model was trained for less than `%s` epochs
fr: Le modèle a été entrainé sur moins de ‘%s’ époques

source: Mixed multi-outcome type '%s' is not supported
fr: Le type ’%s’ n’est pas supporté pour des modèles multi-résultat

source: Unknown outcome type '%s'
fr: Le type `%s` est inconnu pour une colonne de résultats

source: Outcome is factor and the prediction type is '%s'.
fr: La colonne de résultats est catégorielle et la prédiction est de type ‘%s’.

source: Outcome is numeric and the prediction type is '%s'.
fr: La colonne de résultats est numérique et la prédiction est de type ‘%s’.

source: The provided hierarchical object is not recognized with a valid format that can be checked
fr: L’objet hiérarchique fournit n’est pas reconnu dans un format valide qui peut être vérifié

source: The attributes or colnames in the provided hierarchical object use the following reserved names : '%s'. Please change those names as they will lead to unexpected tabnet behavior.
fr: Les attributs ou noms de colonnes dans l’objet hiérarchique fournit utilise les noms réservés suivants : ‘%s’. Veuillez changer ces noms pour éviter un comportement imprévisible de TabNet.

source: `%s` is not a valid loss for outcome of type %s
fr: `%s` n’est pas une fonction objectif valide pour les colonnes de résultat de type %s

source: %s is not a valid early-stopping metric to monitor with `valid_split` = %s
fr: %s n’est pas une métrique valide d’arrêt anticipé avec `valid_split` = %s

source: Currently only the 'adam' optimizer is supported.
fr: Seule la fonction d’optimisation ‘adam’ est supportée pour l’instant.

source: Currently only the 'step' and 'reduce_on_plateau' scheduler are supported.
fr: Seule les planifications ‘step’ et ‘reduce_on_plateau’ sont supportées pour l’instant.

source: Early stopping at epoch %03d
fr: Arrêt anticipé à l’époque %03d

source: Computing importances for a dataset with size %s. This can consume too much memory. We are going to use a sample of size 1e5, You can disable this message by using the `importance_sample_size` argument.
fr: Calcul de l’importance sur un jeu de données de taille %s. Il se peut que cela consomme trop de mémoire. Aussi le jeu de donnée sera réduit aléatoirement à une taille de 1e5. Vous pouvez rendre ce message silencieux en configurant l’argument `importance_sample_size`.

source: Computing importances for a dataset with size %s. This can consume too much memory. We are going to use a sample of size 1e5. You can disable this message by using the `importance_sample_size` argument.
fr: Calcul de l’importance sur un jeu de données de taille %s. Il se peut que cela consomme trop de mémoire. Aussi le jeu de donnée sera réduit aléatoirement à une taille de 1e5. Vous pouvez rendre ce message silencieux en configurant l’argument `importance_sample_size`.

source: 'n_steps' should be a positive integer.
fr: ’n_steps’ doit être un nombre entier positif.

source: 'n_shared' and 'n_independant' can't be both zero.
fr: ’n_shared’ et ’n_independant’ ne peuvent pas être nuls simultanément.

source: Please choose either 'sparsemax' or 'entmax' as 'mask_type'
fr: Vous devez choisir ‘sparsemax’ ou ‘entmax’ pour ‘mask_type’
